/*
    1. Уникализация значений в массиве. (решить через filter)
    Необходимо написать функцию, принимающую в аргументах массив целых чисел и возвращающую новый массив,
    состоящий только из уникальных значений первого массива.
*/

/*
     2. Реализовать методы, которые в процессе выполнения строки (2).plus(3).minus(1) дали бы на выходе 4.
*/

// console.log((2).plus(3).minus(1));

/*
    3. Анаграмма
    Нужно написать функцию, которая проверяет, являются ли две строки анаграммами, причем регистр букв не имеет значения.
    Учитываются лишь символы; пробелы или знаки препинания в расчет не берутся.
*/

function anagram(firstWord, secondWord) {}

/*
    * 4. Напишите функцию, которая будет удалять повторяющиеся значения и возвращать получившийся массив.
    Значения в результирующем массиве должны быть отсортированны по кол-ву слов во входном массиве.
*/

const words = [
  'orange',
  'banana',
  'banana',
  'grapefruit',
  'banana',
  'grapefruit',
  'banana',
];

function solution(words) {}

// console.log(solution(words));

/*
    ** 5. Анаграмма
    Нужно написать функцию, которая проверяет, являются ли две строки анаграммами, причем регистр букв не имеет значения.
    Учитываются лишь символы; пробелы или знаки препинания в расчет не берутся.
*/
